CaseUTwithoutWallFunctions/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2500;
        startFace       737500;
    }
    outlet
    {
        type            patch;
        nFaces          2500;
        startFace       740000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       742500;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       747500;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          5000;
        startFace       752500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          5000;
        startFace       757500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
