CaseUTwithoutWallFunctions/0/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 1.0;
Zref                 0.1;
Zmax		     1.2;	//Top of the domain
zDir                 (0 0 1);
flowDir              (1 0 0);
z0                   0.00055;	//Average height of chain roughness h=0.005 m, z0 ~ 0.1h 
zGround              0.0;
alpha                0.192;	//alpha = 1 / (ln(Zref/z0)) 
a 		     1.56;	//a = Uref / (Zref^alpha)
N 		     200;
IuMax 		     1.0;	//Maximum turbulence intensity
aSigma 		     0.2;	//Multiplier controlling energy-containing eddy or vortex size
aTau		     0.01;	//Multiplier controlling energy-containing eddy or vortex life time
flowVelocity         (0 0 0);
turbulentKE0         1.3;
alphat0              1e-05;
Prt		     0.85;
T0		     315.55;
Tinf                 315.55;   
Ts		     288.55;	//Ts=Tinf-27.4
s0		     0;

// ************************************************************************* //
